experiments/low_latency_pipeline/p0/logs/prod-81107-2.log
2025-08-09 12:40:16.637 | main | INFO | io.prometheus.jmx.JavaAgent | Starting ...
2025-08-09 12:40:16.979 | main | INFO | io.prometheus.jmx.JavaAgent | HTTP enabled [true]
2025-08-09 12:40:16.980 | main | INFO | io.prometheus.jmx.JavaAgent | HTTP host:port [0.0.0.0:7002]
2025-08-09 12:40:16.980 | main | INFO | io.prometheus.jmx.JavaAgent | Starting HTTPServer ...
2025-08-09 12:40:17.032 | main | INFO | io.prometheus.jmx.JavaAgent | HTTPServer started
2025-08-09 12:40:17.033 | main | INFO | io.prometheus.jmx.JavaAgent | OpenTelemetry enabled [false]
2025-08-09 12:40:17.033 | main | INFO | io.prometheus.jmx.JavaAgent | Running ...
49961 records sent, 9992.2 records/sec (4.76 MB/sec), 16.6 ms avg latency, 525.0 ms max latency, 2 ms 50th, 124 ms 95th, 162 ms 99th, 176 ms 99.9th.
50251 records sent, 10048.2 records/sec (4.79 MB/sec), 1.3 ms avg latency, 30.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 26 ms 99.9th.
50140 records sent, 10024.0 records/sec (4.78 MB/sec), 1.0 ms avg latency, 16.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 12 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 11.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50080 records sent, 10014.0 records/sec (4.78 MB/sec), 0.9 ms avg latency, 11.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50080 records sent, 10014.0 records/sec (4.78 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 10.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 9 ms 99.9th.
50089 records sent, 10017.8 records/sec (4.78 MB/sec), 1.1 ms avg latency, 11.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 9 ms 99.9th.
50077 records sent, 10015.4 records/sec (4.78 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50054 records sent, 10008.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50081 records sent, 10014.2 records/sec (4.78 MB/sec), 1.1 ms avg latency, 10.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50069 records sent, 10009.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 18.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 9 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 4 ms 99.9th.
50069 records sent, 10013.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50068 records sent, 10013.6 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50043 records sent, 10006.6 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50055 records sent, 10009.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50045 records sent, 10009.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50070 records sent, 10014.0 records/sec (4.78 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50039 records sent, 10007.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50068 records sent, 10011.6 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50053 records sent, 10010.6 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 8 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 15.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50034 records sent, 10006.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 6.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50067 records sent, 10011.4 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 12.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50049 records sent, 10009.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 4 ms 99.9th.
50031 records sent, 10006.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 11.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 9 ms 99.9th.
50051 records sent, 10010.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 35.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 32 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50049 records sent, 10009.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50071 records sent, 10010.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 17.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50030 records sent, 10006.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50061 records sent, 10012.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 10.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 6 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 6.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 3 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50051 records sent, 10008.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50055 records sent, 10011.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50055 records sent, 10011.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50047 records sent, 10009.4 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 4 ms 99.9th.
50053 records sent, 10008.6 records/sec (4.77 MB/sec), 1.9 ms avg latency, 90.0 ms max latency, 1 ms 50th, 2 ms 95th, 46 ms 99th, 87 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50068 records sent, 10013.6 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50041 records sent, 10006.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50051 records sent, 10010.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50067 records sent, 10009.4 records/sec (4.77 MB/sec), 1.0 ms avg latency, 17.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50046 records sent, 10009.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50057 records sent, 10007.4 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50061 records sent, 10012.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 18.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50020 records sent, 10004.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 5.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 2 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 2.3 ms avg latency, 107.0 ms max latency, 1 ms 50th, 2 ms 95th, 63 ms 99th, 103 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50051 records sent, 10010.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 17.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50040 records sent, 10006.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 6.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 3 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50041 records sent, 10008.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50070 records sent, 10014.0 records/sec (4.78 MB/sec), 1.1 ms avg latency, 15.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50040 records sent, 10006.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50030 records sent, 10006.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 6.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 3 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50041 records sent, 10008.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50055 records sent, 10011.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 22.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 17 ms 99.9th.
50055 records sent, 10009.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 3 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50061 records sent, 10008.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50070 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 16.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50058 records sent, 10011.6 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50052 records sent, 10010.4 records/sec (4.77 MB/sec), 1.0 ms avg latency, 14.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50040 records sent, 10006.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50049 records sent, 10009.8 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 17.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 16.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 5.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 3 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50048 records sent, 10009.6 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50062 records sent, 10010.4 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 9.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 5 ms 99.9th.
50059 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50040 records sent, 10006.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 6.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 2 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50065 records sent, 10013.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50035 records sent, 10005.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 13.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50058 records sent, 10007.6 records/sec (4.77 MB/sec), 1.8 ms avg latency, 87.0 ms max latency, 1 ms 50th, 2 ms 95th, 41 ms 99th, 83 ms 99.9th.
50062 records sent, 10008.4 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 0.9 ms avg latency, 7.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 4 ms 99.9th.
50031 records sent, 10006.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50049 records sent, 10009.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 5.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 2 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 3.2 ms avg latency, 135.0 ms max latency, 1 ms 50th, 2 ms 95th, 89 ms 99th, 131 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 4 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 11.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50049 records sent, 10009.8 records/sec (4.77 MB/sec), 1.2 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 3 ms 99.9th.
50061 records sent, 10010.2 records/sec (4.77 MB/sec), 1.2 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50051 records sent, 10008.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50048 records sent, 10009.6 records/sec (4.77 MB/sec), 1.1 ms avg latency, 13.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50051 records sent, 10008.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 6.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 3 ms 99.9th.
50061 records sent, 10008.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 4 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 16.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50046 records sent, 10007.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 5.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 3 ms 99.9th.
50054 records sent, 10010.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 37.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 34 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 15.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 7.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 3 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50059 records sent, 10009.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50071 records sent, 10012.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50040 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 17.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 2.5 ms avg latency, 117.0 ms max latency, 1 ms 50th, 2 ms 95th, 71 ms 99th, 113 ms 99.9th.
50070 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50060 records sent, 10012.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 8 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50056 records sent, 10011.2 records/sec (4.77 MB/sec), 1.1 ms avg latency, 19.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50035 records sent, 10005.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 15.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 10 ms 99.9th.
50080 records sent, 10014.0 records/sec (4.78 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 7 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 18.0 ms max latency, 1 ms 50th, 1 ms 95th, 2 ms 99th, 7 ms 99.9th.
50030 records sent, 10006.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 5.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 2 ms 99.9th.
50050 records sent, 10008.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50069 records sent, 10011.8 records/sec (4.77 MB/sec), 1.1 ms avg latency, 9.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.
50061 records sent, 10008.2 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50050 records sent, 10010.0 records/sec (4.77 MB/sec), 1.0 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 5 ms 99.9th.
50060 records sent, 10010.0 records/sec (4.77 MB/sec), 1.1 ms avg latency, 8.0 ms max latency, 1 ms 50th, 2 ms 95th, 2 ms 99th, 6 ms 99.9th.